[
  {
    "Titles": "Stocks Close Up with Strong Technology Sector Gains",
    "Links": "http://www.stockpricetoday.com/stock-news/stocks-close-up-with-strong-technology-sector-gains/",
    "Dates": "September 7, 2017",
    "Author": "Pete Southern",
    "Articles": "The New York Stock Exchange closed in the green on Wednesday, aided by hopes of further talks on the US budget and oil stocks: the Dow Jones gained 0.25% and the Nasdaq 0.28%.According to the final results, the Dow Jones Industrial Average index rose by 54.33 points and the Nasdaq, with strong technology sector, by 17.74 points. The S & P 500 expanded index gained 0.31%.President Donald Trump and leaders of the Democratic opposition on Wednesday announced that they agreed to raise the US federal debt ceiling until December 15. But the key is that the signals are multiplying on the improvement of the situation in Europe and in the United States the figures are mixed but lean rather on the positive side.In August, service activity rose to 55.3%, according to the purchasing managers index of the professional association ISM.Certainly events such as Harvey or Irma hurricanes can have a negative impact on some industries, but they also have a positive impact on others such as the reconstruction or autos sector.The Home Depot DIY store chain gained 2.37%.The Dow Jones was also helped Wednesday by the growth of Chevron and ExxonMobil in the wake of rising oil prices listed in New York.Hewlett Packard Enterprise (HPE) dropped 1.97% to $ 13.77. The IT company announced on Tuesday evening better than expected results in the third quarter of its shifted but declining fiscal year, notably due to exceptional items.The airlines were heckled. United Airlines (-1.26% to $ 60.33) lowered its quarterly forecast Wednesday due to disruptions caused by storm Harvey in its flights to and from the southeastern United States."
  },
  {
    "Titles": "Stocks Consolidate While Foreign Exchange Becomes More Volatile",
    "Links": "http://www.stockpricetoday.com/stock-news/stocks-consolidate-while-foreign-exchange-becomes-more-volatile/",
    "Dates": "June 26, 2017",
    "Author": "Pete Southern",
    "Articles": "Stocks were torn between the contrasting performances of the energy sector, supported by the rebound of oil, and the financial and health sectors at the end of last week.The indices, which began the session slightly down, gradually strengthened until later in the day when they consolidated at the end of the session.  In economic data sales of new homes increased 2.9% in May, during which time the average price reached a record according to the US Department of Commerce. However in contrast growth of the private sector in the United States slowed down in June.Oil prices finished slightly up Friday, managing to recover a little at the end of a week of falls. As a result, the index of energy stocks in the S & P 500 recovered with a modest gain.In the foreign exchange market, the euro fell slightly against the dollar in early European trading on Monday, with traders opting for caution at the start of a week of busy schedule of economic indicators in the United States.The Euro gained some ground against the Japanese Yen, at 124.91 yen for one euro – climbing to its highest level in three and a half weeks. The US Dollar also gained against the Japanese Yen.At the beginning of last week, the dollar had slightly increased, reaching its highest level in three weeks against the euro, following comments of the Fed for continued monetary tightening by the US central bank. The rise in US interest rates makes the US Dollar more remunerative and therefore more attractive to investors.For those who wish to transfer money there was still reasons to be cheerful, as exchange rates look set to benefit those who wish to invest or send money to Europe. The European area still looks uncertain, and it’s not clear on how the single currency will hold up over the summer months."
  },
  {
    "Titles": "Amazon Shows Its Hand With Whole Foods Acquisition",
    "Links": "http://www.stockpricetoday.com/stock-news/amazon-shows-its-hand/",
    "Dates": "June 18, 2017",
    "Author": "Pete Southern",
    "Articles": "On the trail to world domination Amazon is now to take over Whole Foods in a whopping $13.6 billion dollar deal. For many years Amazon has been experimenting in groceries, without much success, this deal seems to suggest that the ecommerce giant has conceded that grocery shopping needs to have a mix and match of traditional local outlets and online ordering combined.The Amazon share price reacted positively to the news, gaining a modest 3%. However, the best is still to come. The company will without doubt use this acquisition to get the model correct, and then begin to roll it out into new territories such as the UK.In the UK leading grocery stocks fell with investors beginning to worry on the competition a giant such as Amazon would bring to their (until now) market.  However, Morrisons share price gained, as they already have a deal in place to supply groceries for Amazon Fresh, a small test project in London. This leads many to think if they do decide to pursue this in the UK then that will be their takeover target.Another advantage that Amazon have, compared to the main players in the UK, is that shareholders of Amazon do not expect dividend growth. They are perfectly happy to see revenue poured back into development, and as long as the share price appreciates everyone is happy.In the UK most supermarkets share holders are dependent on dividends to see good long term returns from holding their shares. Prices have not shown steady growth in what is now a unstable sector, due to cut price stores like Aldi and Lidl take more and more market share. With such a large firm such as Amazon on their way to the UK, it would not be surprising to see some major moves from the UK firms to position themselves correctly for when the shake up of their industry happens."
  },
  {
    "Titles": "Will Facebook’s Stock Rise To $170 In Coming Years?",
    "Links": "http://www.stockpricetoday.com/stock-news/will-facebooks-stock-rise-to-170-in-coming-years/",
    "Dates": "June 10, 2016",
    "Author": "Pete Southern",
    "Articles": "According to an eVestment report Facebook’s stock is now more popular than ever. It’s moved up from the 24rd most held stock in September 15 to the 16th most held in December 15. This tells a story in itself, as investors are happy to hold and institutions are accumulating like never before. The story is; Facebook stock price has a lot further to gain over the next few years.Whilst other “social” stars fall out of favor (cough cough Twitter) Facebook’s innovation and continued development of its acclaimed advertising platform sets it apart from the “also rans”.Video adverts are doing great, and other new formats are a hit with businesses, such as call now adverts for local page promotions. Which can only mean one thing, money is still rolling in.User growth has been strong and this can only increase revenue over time. Because of this there are analysts calling for a $170 stock price for FB. Whilst this target may take some time, it’s not beyond the realms of possibility. Currently FB stands at $116, so that is quite a decent amount of upside if the calls are correct.As you know, Facebook is a forward thinking company and we also think that MZ is cunningly worming his way into Chinese hearts.He has been seen on high profile visits to the country in recent times, and will surely be looking to build some bridges to maybe one day open up an audience that will dwarf all others. So, long term (if that ever happens of course) it could be a complete game changer for the social network.Either way, any strong retrace in the wider market will be seen as an entry opportunity for many."
  },
  {
    "Titles": "Stocks End Negative, Wal-Mart Rockets",
    "Links": "http://www.stockpricetoday.com/stock-news/stocks-end-negative-wal-mart-rockets/",
    "Dates": "May 20, 2016",
    "Author": "Pete Southern",
    "Articles": "US markets all ended negative but did manage to return from their lows yesterday, with the Dow Jones, Nasdaq and S&P500 all reversing around midday to end just short of their opening levels. Oil stocks were pulling on the markets once again as Crude oil fell for a 2nd consecutive day, then sharply reversed in open outcry which followed through into the Asian session.Shell CEO John Hofmeister stated: “We cannot ever produce enough oil, in my opinion, to satisfy global demand five or 10 years out. We have to start using natural gas and more biofuels as a source of transportation fuel,” prompting a speculative vision of the future for Oil prices.European stocks opened high this morning with the jump in Crude Oil helping heavyweight stocks on the FTSE 100 and CAC40.Leaders and movers on the US Markets were:Wal-Mart Stores Inc. (WMT) stock price jumped 9.5% on Thursday with a bullish increase in sales reported.  Results smashed analyst expectations and warmed investors up as they continue to “make a better experience for shoppers” in Wal-Mart stores.LendingClub Corporation (LC) were down 7.27% as concerns were raised as the New York Department of Financial Services, the state’s top financial regulator, are looking into practices and compliance, along with rates given to New Yorkers using the service.\nAmerican Eagle Outfitters, Inc. (AEO) flew by 18.3% after the company reported strong results for Q1 2016. Revenue was up 7% and store sales up 6% in the period. The company continues to post string EPS growth and it seems investors are taking notice of the Pittsburgh-based teen clothing retailer."
  },
  {
    "Titles": "Markets Fall After Open, Investors Not Sure What Summer Brings",
    "Links": "http://www.stockpricetoday.com/stock-news/markets-fall-after-open-investors-not-sure-what-summer-brings/",
    "Dates": "May 12, 2016",
    "Author": "Pete Southern",
    "Articles": "After futures prices for main indices were up in pre-market trading, the open showed where investors were heading, and the selling ensued. The Dow Jones, S&P500 and Nasdaq all plunged into negative territory after the first hour of trading.Worries that came from the increase in unemployment claims last week still hangover the market, and with approaching summer months, and an impending Brexit vote to contend with in Europe, there doesn’t seem anything bullish on the horizon.Demand for Gold remained strong, as always during market weakness, with the yellow stuff holding above the April highs, albeit on a down day.Import prices data showed an increase for April, as released before the bell, suggesting that inflation below the Fed’s 2 percent was becoming less likely.Although the markets are negative there are a few notable stocks on the move upwards today.Monsanto (MON) was at $99.28 a gain of over 9% after rumors that the U.S. seed company was said to be the possible acquisition target of Bayer AG.Infoblox Inc. (BLOX) blew upwards with a gain of over 20% on the takeover offer from Thoma Bravo. Bloomberg quoted:“Infoblox shares are soaring 18.81% to $18.19 on Thursday morning after the company received a buyout approach from technology-focused private equity firm Thoma Bravo, valuing the deal at around $886 million”\nJack in the Box Inc. (JACK) sprung into life (no pun) with a shooting gain of 14% after pushing numbers that beat all estimates after the bell yesterday. Zaks commented:“Shares soared almost 11% during afterhours trading yesterday, reflecting positive investor sentiment on the back of solid comps growth in the Qdoba restaurants.” And also “Adjusted earnings of 85 cents per share missed the Zacks Consensus Estimate of 70 cents by 21.4%. Further, it surged 23.2% year over year on lower expenses and lower tax rate.”Even though the stock has gained it still remains 20% down over the last 12 months."
  },
  {
    "Titles": "Energy and Gold Stocks Down, Yet Nasdaq Holding Firm",
    "Links": "http://www.stockpricetoday.com/stock-news/energy-and-gold-stocks-down-yet-nasdaq-holding-firm/",
    "Dates": "May 9, 2016",
    "Author": "Pete Southern",
    "Articles": "Indices in the USA held firm in early trading, after wobbles in Europe with Crude Oil falling 3% and mining stocks taking a battering. All that didn’t seem to faze the S&P500 or the Nasdaq 100, with only the Dow Jones staying negative from the big 3 in early trade.Pharmaceutical stocks were on the move higher, with double digit percent gains for Horizon Pharma (HZNP), Eagle Pharmaceutical (EGRX) and Infinity (INFI). Surprisingly down on the day Valeant (VRX) who have promised to do “better with deadlines” and posted Q1 earning guidance of $1.30 to $1.55 per share.However, energy stocks were being hit hard. With Crude falling amid concerns on the Canadian wildfires, stocks were down (mostly) across the board, with Suncoke Energy and Chesapeake in the red negative board once again.Gold stocks were weak also, with Barrick Gold falling hard and down over 5% midway through trading,  Silver Wheaton and Newmont Mining Corporation also pulling back over 6%. Gold miners have been on a stunning run since the early part of 2016, and although this is a decent “blip”, they still remain in a bullish uptrend.Here are MarketRealists comments on Gold:“The overall performance of gold in 1Q16 was remarkably positive. Gold claimed its highest quarterly return in almost three decades. Silver has outperformed gold over the past month. Gold and silver have risen 21% and 25.2%, respectively, since the beginning of the year.”It’s hard to imagine a trend this strong continuing without a good retrace at some point. This could be the beginning, however most analysts seem to think there is more money waiting on sidelines for Gold and Silver, and any decent fall may be seen as a good entry point for those that missed the initial moves."
  },
  {
    "Titles": "Indices Gained, But Outlook Still Uncertain For Stocks",
    "Links": "http://www.stockpricetoday.com/stock-news/indices-gained-but-outlook-still-uncertain-for-stocks/",
    "Dates": "May 3, 2016",
    "Author": "Pete Southern",
    "Articles": "Indices gained a little Monday, but not a spectacular rise for the first trading day of May. Investors will be worrying about movements in Europe from the ECB and the Brexit vote, which is due in June.On home soil, ISM manufacturing PMI disappointed, coming in at 50.8 and missing estimates of 51.6. This week the main focus of economic data will be on unemployment figures and non-farm payrolls due on Thursday and Friday respectively.Gold managed to hold firm near the new high it posted toward the end of last week, but Oil has lost momentum somewhat. Although it’s not slamming down hard, it may have found it’s short term resistance for now, and search for a support is on the way.Some stocks that were gaining on the day are as follows:(NFLX) Netflix gained 3.61% to 93.19 on reasonably thin volume. NFLX recently posted another set of positive results showing an net increase in revenues compared to Q1 2015, and although costs of revenue increased, net income cash flows were up also. Investors seem to have found value in the stock above the $90 level.On the gainers list today is (AMZN) Amazon, which also recently published a set of results that beat forecasts and gave investors’ confidence that the business is still on a strong footing for growth in its many markets. AMZN gained 3.56% to end the day at $683.57.With a gain of 3.30% (MDLZ) Mondelez pushed higher to end the day at the 2016 high as the string trend from the February low continues. MDLZ posted strong numbers last week, and even though revenue fell, they still beat all forecasts, and posted a 0.48 EPS, beating estimates by 0.09. It looks like the trend is string and could be a good stock to watch.Data sourced from: https://www.stockmonitor.com/quotes/"
  },
  {
    "Titles": "Stocks Gaining and Losing As Market Opens",
    "Links": "http://www.stockpricetoday.com/stock-news/stocks-gaining-and-losing-as-market-opens/",
    "Dates": "April 29, 2016",
    "Author": "Pete Southern",
    "Articles": "In early trade today there were some strong moves, particularly in the technology and biotech sectors. Here is a short brief of this morning’s gainers and losers.eHealth Inc beat forecasts after the market closed yesterday and jumped 21.5% in early trade. After reporting a loss in the same quarter of 2015, it has now reported a first-quarter net income of $18 million. This smashed all analyst forecasts, of 40 cents per share.SkyWest (SKYW) reported a jump in net income to $27 million for Q1 in 2016, compared to $10 million in the same quarter last year. Stating the improvement in operating margin was primarily due to new aircraft added to profitable flying contracts.Chip Childs, SkyWest, Inc. Chief Executive Officer, commented on the report saying “The demand for our service and aircraft is strong and we remain focused on continuing to drive incremental improvement in fleet economics to create long-term value for our stakeholders.On the losing side, Bottomline Technologies (EPAY) reported a loss of $4.2 million for the first quarter of 2016. EPAY posted revenue of $86.2 million in the period, falling short of the consensus of analysts. The stock price was down near 22% in early trade.Seagate (STX) fell 12% after market opened with a miss on its results. Revenue at Seagate declined 22% year over year to $2.595 billion. CEO Steve Luczo said “Our quarterly results fell short of our expectations as a result of several near-term demand factors.  Accordingly, we are aggressively working to position Seagate to respond to new demand levels and are committed to ongoing financial discipline.”"
  },
  {
    "Titles": "Weaker Open Looms As Tech Stocks Are In Focus",
    "Links": "http://www.stockpricetoday.com/stock-news/weaker-open-looms-as-tech-stocks-are-in-focus/",
    "Dates": "April 29, 2016",
    "Author": "Pete Southern",
    "Articles": "Futures pre-market were indicating a weaker open for the US Markets, with the Dow Jones, S&P500 and Nasdaq all in the red after disappointment in consumer data.Economic data released showed consumer spending gained only 0.1% in March, missing Wall Street expectations. Following on from that MarketWatch commented:The PCE price index, the Federal Reserve’s preferred measure of inflation, showed that price pressures seen earlier in the year have abated somewhat, with the index rising just 0.8% in the 12 months ending in March.Tech stocks have been hurting this week, with lower numbers from Apple and Twitter, however Ebay beat forecasts and Amazon is now souring pre-market. The Nasdaq 100 still remains weak.Amazon shares jumped by beating forecasts, Yahoo commented:Shares of Amazon jumped 12.3 percent to $676.24 in premarket trading after the company’s quarterly results blew past analysts’ expectations.Crude Oil continues to push higher with price heading up to $46.50 per barrel in the Europe session. As the chart below shows, Oil is going parabolic at the moment, and doesn’t seem to be losing any momentum at all.Gold is also on a huge rally, and at the time of writing it is sitting at the high of 2016, and looking likely to break it. There has been a clear bullish flag pattern formed in Gold since early February, and that now looks to be coming to completion.All eyes will no doubt be focused on the big tech stocks once again, as the market opens. Facebook, Google and Amazon will be the most followed in early trade. With a rise of 12% pre-market it will be an interesting session for Amazon."
  },
  {
    "Titles": "Stocks Fly As Oil Freeze Looks Likely",
    "Links": "http://www.stockpricetoday.com/stock-news/stocks-fly-as-oil-freeze-looks-likely/",
    "Dates": "April 13, 2016",
    "Author": "Pete Southern",
    "Articles": "The markets burst into action yesterday amid news that a final deal for a freeze in Oil production, from Russia and major nations, will not depend on Iran. Crude Oil pushed up 3% to within a whisker of the March 2016 high.Stocks gained with the S&P500 closing up at 2,061.72 and the Dow Jones Industrial Average at 17,721.25.The rise looks set to continue, with major European indices joining in the surge. The FTSE 100 rushed to a 2016 high during early morning trading, buoyed by Oil prices.Whilst US markets are not hitting new highs for the year, this strength could yet push the market that way. Energy stocks are gaining and with a surge in commodities, the market doesn’t yet look set for a fall.However, a lot will depend on earning season. Reuters commented today:Investors will focus on corporate earnings over the next several weeks, amid turbulent global markets and uncertainty surrounding the U.S. Federal Reserve’s plan to raise interest rates.Yet for now, advancing issues are outnumbering declining issues on the NYSE and Nasdaq.Gold held firm, after a recent rise from $1200. However, early European trade has seen the precious metal pull back a little, which could aid the fuel into stocks."
  },
  {
    "Titles": "Markets Turn Down As Earnings Begin",
    "Links": "http://www.stockpricetoday.com/stock-news/markets-turn-down-as-earnings-begin/",
    "Dates": "April 12, 2016",
    "Author": "Pete Southern",
    "Articles": "After an initial rise on Monday US Markets turned downward, in anticipation of a “season” of quarterly results that do not look to be giving investors’ confidence.As usual, the aluminum producer Alcoa kicked off the earnings and confirmed the pessimism. Its results and outlook disappointed, and the stock price lost nearly 4% in after-hours trading.The profits of companies in the S&P 500 are expected to be down 7.7% on average in the first quarter, according to media outlets.The stock market has experienced a turbulent start to the year, followed by a strong rebound since mid-February and the major indices are now little changed since the 2016 open. As usual also, several banks will announce their results this week, starting with JPMorgan Chase on Wednesday.Financial stocks index, which so far is the worst performing sector since the beginning of the year, posted a modest gain of 0.34% on Monday. However, the only sector to finish up was natural resources.The Dow Jones lost 20.55 points and closed at 17,556.41.Back to stocks, Yahoo gained 1.14%, with the parent company of the British newspaper Daily Mail talking with third parties to mount a bid on the internet assets of the US group.Norfolk Southern lost 2.7%, as Canadian Pacific decided to abandon its takeover bid of $28 billion.On the foreign exchange market, the dollar reduced its losses against the yen after touching a 17-month low of 107.64, with Japan again warning it could intervene to weaken the currency. A number of officials from the Federal Reserve will speak this week but traders are not holding out hope for anything unexpected."
  }
]